{"config": [{"config": {"padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 15, "strides": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 15, "strides": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 200, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 10, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}