{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.5", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "filters": 15, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "name": "conv2d_2", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 15, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "beta_regularizer": null, "center": true, "name": "batch_normalization_1", "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "bias_regularizer": null, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "bias_regularizer": null, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}